__author__ = 'fmy'

import sys
sys.path.append('../Chapter_10')

import Chapter_10


"正确重载运算符"
# 在Python中函数调用(),属性调用.和元素访问/切片[]也是运算符
# 本章我们讨论:
# · Python如何处理中缀运算符中不同类型的操作数
# · 使用鸭子类型或显式类型检查处理不同类型的操作数
# · 中缀运算符如何表明自己无法处理操作数
# · 众多比较运算符(如==,>,<=等)的特殊行为
# · 增量赋值运算符(如+=)的默认处理方式和重载方式


# --------------------------------------------------
# 13.1 运算符重载基础
print('*' * 50)
# Python对重载施加了一些限制,做到灵活性、可用性和安全性方面的平衡
# · 不能重载内置类型的运算符
# · 不能新建运算符,只能重载现有的
# · 某些运算符不能重载,如is,and,or,not(不过|,&,^和~可以)


# --------------------------------------------------
# 13.2 亿元运算符
print('*' * 50)
# -(__neg__)
# +(__pos__)
# ~(__invert__),对整数按位取反

print(Chapter_10.Vector([5, 5]))
